
{"date": "Wednesday October 10 2018",

   "title": "Monica murder probe moves to Mombasa",

   "article": ["\nCitizen TV journalist Jacque Maribe (left) and her fiancé Joseph Irungu alas 'Jowie' at the Milimani Law Courts on Tuesday, October 9, 2018. PHOTO | JACQUELINE KUBANIA | NATION MEDIA GROUP  ", "Top investigators in the murder of Ms Monica Kimani have shifted operations to the Coast in search of what they termed “crucial materials and information”.", "One of the detectives leading the team left Nairobi for Mombasa after the court hearing yesterday during which the suspects, Mr Joseph Irungu alias Jowie and TV journalist Jacque Maribe, were arraigned for murder. The officer joined a team that left on Sunday afternoon.", "In Mombasa, a Nation source said, detectives hope to arrest a suspect, recover the keys to Ms Kimani’s Lamuria Gardens flat, the keys to her car, and any other items or valuables which may have been taken from the deceased’s home by her killers.", "Investigators are also hopeful that the other man, seen on surveillance camera footage leaving Ms Kimani's flat in Ms Maribe's car in the company of an individual police believe to be Mr Irungu, will help tie up the final loose ends in their inquiry into Ms Kimani's chilling killing.", "Yesterday, Mr Irungu and his fiancée, Ms Maribe, were arraigned at the Kilimani Law Courts but did not plead because the court ordered that Ms Maribe be taken for a psychiatric assessment as required by the law for suspects charged with capital offences. The court also ordered that Mr Irungu be treated for a gunshot wound, thought to be self-inflicted.", "Ms Maribe will be remanded at the Langa'ta Women’s Prison while her fiancé will be held at the Industrial Area Remand Prison. They will both be returned to court on Monday to answer to a murder charge.", "Initially, Ms Maribe was scheduled to be charged on Thursday, but Director of Public Prosecutions Noordin Haji directed that the two be charged jointly yesterday.", "Detectives are expected to use the next couple of days to complete evidence collection and tie up the loose ends in the case. ", "Yesterday, Director of Criminal Investigations George Kinoti said a comprehensive DNA and forensic analysis of material from the scene of crime is yet to be finalised, the murder weapon has not been recovered, and a motive for the September 19 attack during which Ms Kimani was killed by having her throat slit has not been established.", "Mr Kinoti also said that a team of detectives sent to South Sudan to gather information on Ms Kimani's life, travel details and business operations is still out in the field.", "Sources said that an analysis matching the DNA from samples collected from Mr Irungu on Friday and those collected from the scene of crime and partially burnt clothes had been completed.", "“We were expecting the results today but there has been a bit of delay. We are hopeful that we will get them tomorrow,” an officer said yesterday. Lawyer Cliff Ombeta told the Daily Nation that the two suspects’ legal teams would ask for samples from which the DNA analysis has been conducted.", "\nMr Maribe says police seeking to \"become famous\" by prosecuting her because she is a celebrity.", "In a statement, the former president said he was overwhelmed by messages of goodwill from", "\nAuthorities link witchcraft accusations to land and property inheritance in families. "]
 }
