{"articleUrl": "https://www.nation.co.ke/news/world/Khashoggi-murder--planned-in-savage-manner-/1068-4817280-h15c0z/index.html",
   "date": "Monday October 22 2018",

    "article": ["\nA demonstrator dressed as Saudi Arabian Crown Prince Mohammed bin Salman (left) with blood on his hands protests outside the Saudi Embassy in Washington, DC, on October 8, 2018, demanding justice for missing Saudi journalist Jamal Khashoggi. PHOTO | AFP ", "Riyadh said on Saturday that Khashoggi, a former regime insider turned dissident, died during a \"brawl\" inside the consulate after a visit on October 2 to get documents.", "Turkish pro-government media has said the team interrogated, tortured and decapitated Khashoggi but a pro-government columnist Abdulkadir Selvi on Monday wrote in Hurriyet daily that Khashoggi was strangled to death before he was cut up into 15 pieces.", "The murder of Saudi journalist Jamal Khashoggi inside Riyadh's Istanbul consulate was \"savagely planned\", Turkey's ruling party spokesman said on Monday, the first official indication from Ankara it believes a plot was hatched in advance.", "\"This was extremely savagely planned, and we are faced with a situation where there has been a lot of effort to whitewash this,\" Justice and Development Party (AKP) spokesman Omer Celik told reporters in Ankara.", "\"This is a very complicated murder,\" Celik said, warning that the Turkish government would not be drawn into speculation. \"Everyone (else) can speculate but we cannot speculate,\" Celik added.", "He also dismissed claims of \"bargaining\" between Saudi Arabia and Turkey as \"immoral\".", "Riyadh said on Saturday that Khashoggi, a former regime insider turned dissident, died during a \"brawl\" inside the consulate after a visit on October 2 to get documents.", "It added 18 Saudis were arrested in connection with his death and two top aides of Crown Prince Mohammed bin Salman, as well as three other intelligence agents, were fired.", "Before Riyadh's admission, Turkish sources said a team of 15 Saudis were sent to Istanbul and killed Khashoggi, a critic of the crown prince who moved to the United States last year and wrote for the Washington Post.", "Turkish pro-government media has said the team interrogated, tortured and decapitated Khashoggi but a pro-government columnist Abdulkadir Selvi on Monday wrote in Hurriyet daily that Khashoggi was strangled to death before he was cut up into 15 pieces.", "Celik pointed to CCTV footage published by CNN on Monday, which the American broadcaster claimed showed one of the Saudi officials acting as a body double for Khashoggi and leaving the consulate.", "A senior Turkish official quoted by CNN said that the Saudi was \"brought to Istanbul to act as a body double\" for Khashoggi, adding: \"This was a premeditated murder and the body was moved out of the consulate.\"", "In the video a man, named by CNN as Mustafa al-Madani, left the consulate by the back exit wearing what appeared to be Khashoggi's clothes -- although the shoes do not match those the journalist appeared to be wearing in CCTV footage of him entering the consulate.", "\nStatement cames the day after Saudi authorities conceded Khashoggi was killed inside their diplomatic compound in Istanbul.", "\nA three-way voting process will determine the finalists.", "\nDream comes true for 80-year-old Freda Shibonje. ", "\nGet Breaking News Delivered to your Inbox\n"],
    "imageUrl": "https://www.nation.co.ke/image/view/-/4801114/medRes/2137422/-/cbb4uo/-/Journalist+4.jpg",
     "title": "Turkey says Khashoggi murder 'planned in savage manner'"}
